app/controllers/conditions_controller.rb

  def index
    @conditions = Condition.all
---
SELECT * FROM `conditions`

  def show
    @condition = Condition.find(params[:id])
---
SELECT * FROM `conditions` WHERE (`conditions`.`id` = 1)

  def edit
    @condition = Condition.find(params[:id])
---
SELECT * FROM `conditions` WHERE (`conditions`.`id` = 2)

  def create
    @condition = Condition.new(params[:condition])

    respond_to do |format|
      if @condition.save
---
INSERT INTO `conditions` (`start_date`, `pmd_patient_no`, `created_at`, `updated_at`, `treated_by`, `treat_notes`, `end_date`) VALUES('2009-06-18', 111, '2009-06-18 21:25:21', '2009-06-18 21:25:21', 'need value', 'my notes', '2009-06-18')

  def update
    @condition = Condition.find(params[:id])

    respond_to do |format|
      if @condition.update_attributes(params[:condition])
---
SELECT * FROM `conditions` WHERE (`conditions`.`id` = 2)
UPDATE `conditions` SET `updated_at` = '2009-06-30 16:39:53', `start_date` = '2009-06-30', `google_url` = 'https://www.google.com/health/ref/Abdominal+Cramps', `end_date` = '2009-06-30', `treated_by` = '', `wiki_url` = 'http://wiki.answers.com/Q/Special:Search&search=have%2Babdominal%2Bcramps&limitn=old”', `pmd_patient_no` = 11, `treat_notes` = '' WHERE `id` = 53

  def destroy
    @condition = Condition.find(params[:id])
    @condition.destroy
---
SELECT * FROM `conditions` WHERE (`conditions`.`id` = 53)
DELETE FROM `conditions` WHERE `id` = 53