app/controllers/editransactions_controller.rb

SELECT * FROM `editransactions`
---
  def index
    @editransactions = Editransaction.all

SELECT * FROM `editransactions` WHERE (`editransactions`.`id` = 1)
---
  def show
    @editransaction = Editransaction.find(params[:id])

SELECT * FROM `editransactions` WHERE (`editransactions`.`id` = 1)
---
  def edit
    @editransaction = Editransaction.find(params[:id])

INSERT INTO `editransactions` (`isa06`, `isa07`, `created_at`, `isa08`, `updated_at`, `isa09`, `isa10`, `isa11`, `isa01`, `isa12`, `isa02`, `isa13`, `isa03`, `isa14`, `isa04`, `isa15`, `isa05`, `isa16`) VALUES(NULL, NULL, '2009-05-14 22:06:15', NULL, '2009-05-14 22:06:15', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @editransaction = Editransaction.new(params[:editransaction])

    respond_to do |format|
      if @editransaction.save

SELECT * FROM `editransactions` WHERE (`editransactions`.`id` = 1)
UPDATE `editransactions` SET `updated_at` = '2009-06-12 02:29:10', `isa03` = '555', `isa02` = '989888555', `isa01` = '55598' WHERE `id` = 366350463
---
  def update
    @editransaction = Editransaction.find(params[:id])

    respond_to do |format|
      if @editransaction.update_attributes(params[:editransaction])

SELECT * FROM `editransactions` WHERE (`editransactions`.`id` = 1)
DELETE FROM `editransactions` WHERE `id` = 1
---
  def destroy
    @editransaction = Editransaction.find(params[:id])
    @editransaction.destroy