app/controllers/my_record_controller.rb

SELECT * FROM `conditions` ORDER BY name
SELECT * FROM `patient_conditions` ORDER BY condition_name
---
  def index
  # Get access to condition hash and partial of _record
    @conditions = Condition.find_my_condition
    @record = find_record
  # Get access to patientcondition hash
    @patient_conditions = PatientCondition.find_my_condition

SELECT * FROM `conditions` WHERE (`conditions`.`id` = 953125641)
---
  def add_to_record
#  SCW - BEGIN - END debugger inserted
#  debugger
    anycondition = Condition.find(params[:id])     # <label id="code.emd.f.find"/>