app/controllers/myrecord_controller.rb

  def index
    @conditions = Condition.find_my_conditions
---
SELECT * FROM `conditions` ORDER BY name