app/controllers/patient_conditions_controller.rb

SELECT * FROM `conditions`
SELECT * FROM `patient_conditions`
SELECT * FROM `conditions` WHERE (`conditions`.`id` IS NULL) LIMIT 1
---
  def index
    @patient_conditions = PatientCondition.all
    @conditions = Condition.find(:all)

SELECT * FROM `conditions` WHERE (`conditions`.`id` IN (56,54))
---
  def find_condition_name(id)
    @conditions = Condition.find(:all)

SELECT * FROM `patient_conditions` WHERE (`patient_conditions`.`id` = 996332877)
---
  def show
    @patient_condition = PatientCondition.find(params[:id])

SELECT * FROM `patient_conditions` WHERE (`patient_conditions`.`id` = 1)
---
  def show_condition_name
    @patient_condition = PatientCondition.find(params[:id], :include => [:conditions])

SELECT * FROM `patient_conditions` WHERE (`patient_conditions`.`id` = 996332877)
---
  def edit
    @patient_condition = PatientCondition.find(params[:id])

INSERT INTO `patient_conditions` (`start_date`, `created_at`, `condition_id`, `updated_at`, `patient_profile_id`, `treated_by`, `treat_notes`, `end_date`) VALUES('2008-03-02', '2009-08-05 02:21:33', 56, '2009-08-05 02:21:33', NULL, 'Dr Wade', 'Solid sucker punch to the belly did the trick', '2009-08-05')
---
  def create
    @patient_condition = PatientCondition.new(params[:patient_condition])
    respond_to do |format|
      if @patient_condition.save

SELECT * FROM `patient_conditions` WHERE (`patient_conditions`.`id` = 53)
UPDATE `patient_conditions` SET `updated_at` = '2009-07-07 04:10:25', `pmd_patient_no` = 1, `treat_notes` = '' WHERE `id` = 53
---
  def update
    @patient_condition = PatientCondition.find(params[:id])

    respond_to do |format|
      if @patient_condition.update_attributes(params[:patient_condition])

SELECT * FROM `patient_conditions` WHERE (`patient_conditions`.`id` = 3314848)
DELETE FROM `patient_conditions` WHERE `id` = 3314848
---
  def destroy
    @patient_condition = PatientCondition.find(params[:id])
    @patient_condition.destroy