app/controllers/patient_profiles_controller.rb

SELECT * FROM `patient_profiles`
---
  def index
    @patient_profiles = PatientProfile.all

SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 1000)
---
  def show
    @patient_profile = PatientProfile.find(params[:id])

SELECT * FROM `patient_profiles` ORDER BY patient_profiles.id DESC LIMIT 1
SELECT count(*) AS count_all FROM `patient_profiles`
---
  def new
    @patient_profile = PatientProfile.new

    # Temp, until sessions provides these two fields? ---------------------------------------------------------------------------------
      if PatientProfile.count >= 1

SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 422094564)
---
  def edit
    @patient_profile = PatientProfile.find(params[:id])

INSERT INTO `patient_profiles` (`city`, `primary_address`, `state_province`, `created_at`, `zip_code`, `phone_emergency`, `ethnicity`, `phone_fax`, `updated_at`, `pmd_user_id`, `phone_home`, `gender`, `pmd_patient_id`, `alternate_address`, `phone_work`, `last_name`, `date_of_birth`, `physician_id`, `first_name`, `email`, `phone_mobile`) VALUES('', '', 'US', '2009-08-04 18:15:54', '', '', 101, '', '2009-08-04 18:15:54', 100000100, '', 'M', 100000100, '', '', 'wade', '2009-08-04', 12, 'scott', 'scwade@yahoo.com', '')
---
  def create
    @patient_profile = PatientProfile.new(params[:patient_profile])

    respond_to do |format|
      if @patient_profile.save

SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 120605670)
---
  def update
    @patient_profile = PatientProfile.find(params[:id])

SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 422094564)
DELETE FROM `patient_profiles` WHERE `id` = 422094564
---
  def destroy
    @patient_profile = PatientProfile.find(params[:id])
    @patient_profile.destroy