app/controllers/users_controller.rb

  def index
    @users = User.all(:order => :username)
---
SELECT * FROM `users` ORDER BY name

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 996332879) LIMIT 1

  def edit
      @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 996332879) LIMIT 1

  def create
    @user = User.new(params[:user])
    ### Add the creator of the object (in this case User) into our record
    @user.creator = current_user
    ### Save the user roles when saving the user
    #@user.save do |result|
    @user.save && check_and_set_role do |result|
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('tiffany', '-6166626480.375835559521679', '2009-05-14 23:01:22', '2009-05-14 23:01:22', '974dbef75bfea14b1df9c934d5d95bdec26a3a04')

  def update
    @user = User.find(params[:id])
    #@user = current_user
    ### Save the user roles when saving the user
    #@user.attributes = params[:user]
    check_and_set_role && @user.attributes = params[:user]
    @user.save do |result|
---
SELECT * FROM `users` WHERE (`users`.`id` = 996332879) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-06-12 18:41:39', `salt` = '1', `hashed_password` = '1' WHERE `id` = 442820205

  def destroy
    @user = User.find(params[:id])
    #SCW original    @user.destroy
    #SCWa - begin
    begin
      @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 996332879) LIMIT 1
DELETE FROM `users` WHERE `id` = 1

  def load_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 996332879) LIMIT 1